/*Java: знакомство и как пользоваться базовым API (семинары)
Урок 2. Почему вы не можете не использовать API
Формат сдачи: ссылка на подписанный git-проект.

Дополнительные задания

Дана json-строка (можно сохранить в файл и читать из файла)
[{"фамилия":"Иванов","оценка":"5","предмет":"Математика"},{"фамилия":"Петрова","оценка":"4","предмет":"Информатика"},{"фамилия":"Краснов","оценка":"5","предмет":"Физика"}]
Написать метод(ы), который распарсит json и, используя StringBuilder, создаст строки вида: Студент [фамилия] получил [оценка] по предмету [предмет].
Пример вывода:
Студент Иванов получил 5 по предмету Математика.
Студент Петрова получил 4 по предмету Информатика.
Студент Краснов получил 5 по предмету Физика.

Обучающийся: ШИТОВ Олег Владимирович, "Разработчик Python", поток 4544, будни, утро.  15.06.2023
 */

package org.example;

import java.lang.String;

public class Task_2_2 {
    public static void main(String[] args) {
        String str = "[{\"фамилия\":\"Иванов\",\"оценка\":\"5\",\"предмет\":\"Математика\"},{\"фамилия\":\"Петрова\"," +
                "\"оценка\":\"4\",\"предмет\":\"Информатика\"},{\"фамилия\":\"Краснов\",\"оценка\":\"5\",\"предмет\":\""
                +
                "Физика\"}]";

        str = str.replace("{", "").replace("}", "");
        str = str.replace("[", "").replace("]", "");
        str = str.replace("\"", "").replace("\'", "");

        String[] terms = str.split(",");
        StringBuilder phrase = new StringBuilder();
        Integer count = 0; // счетчик по числу фраз, состоящих из 3-х выражений
        for (String term : terms) {
            String[] tmp = term.split(":");
            count++;
            switch (count) {
                case 1:
                    phrase.append("Студент " + tmp[1]);
                    break;
                case 2:
                    phrase.append(" получил " + tmp[1]);
                    break;
                case 3:
                    phrase.append(" по предмету " + tmp[1] + ".");
                    System.out.println(phrase);
                    count = 0;
                    phrase.setLength(0);
                    break;
            }
        }
    }
}

/*
 * Пример применения:
 * Студент Иванов получил 5 по предмету Математика.
 * Студент Петрова получил 4 по предмету Информатика.
 * Студент Краснов получил 5 по предмету Физика.
 */